1-READ file

In [3]:
import pandas as pd

In [5]:
data=pd.read_csv("C:/Users/enaam/OneDrive/Desktop/PYTHON/bank_data.csv")

In [6]:
data

,TransactionID,CustomerID,CustomerDOB,CusGender,CustLocation,CustAccountBalance,TransactionDate,TransactionTime,TransactionAmount
0,T1,C5841053,10/1/1994,F,JAMSHEDPUR,17819.05,8/2/2016,12:00:00 AM,25.0
1,T2,C2142763,4/4/1957,M,JHAJJAR,2270.69,8/2/2016,12:00:00 AM,27999.0
2,T3,C4417068,26/11/1996,F,MUMBAI,17874.44,8/2/2016,12:00:00 AM,459.0
3,T4,C5342380,14/09/1973,F,MUMBAI,866503.21,8/2/2016,12:00:00 AM,2060.0
4,T5,C9031234,24/03/1988,F,NAVI MUMBAI,6714.43,8/2/2016,12:00:00 AM,1762.5
...,...,...,...,...,...,...,...,...,...
35123,T35124,C5923939,20/07/1990,M,NOIDA,214.39,NaN,12:00:00 AM,102.0
35124,T35125,C5642844,4/11/1989,F,THIRUVANANTHAPURAM,219310.56,NaN,12:00:00 AM,170.0
35125,T35126,C4342918,13/04/1993,M,JAMNAGAR,359.01,NaN,12:00:00 AM,2639.0
35126,T35127,C5329273,18/06/1988,F,LUCKNOW,52524.61,NaN,12:00:00 AM,163.0
35127,T35128,C6714728,Oct-00,NaN,NaN,NaN,NaN,NaN,NaN

In [8]:
data.dtypes

TransactionID            object
CustomerID               object
CustomerDOB              object
CusGender                object
CustLocation             object
 CustAccountBalance      object
TransactionDate          object
TransactionTime          object
TransactionAmount       float64
dtype: object

2-"get the first five record"

In [12]:
data.head(20)

,TransactionID,CustomerID,CustomerDOB,CusGender,CustLocation,CustAccountBalance,TransactionDate,TransactionTime,TransactionAmount
0,T1,C5841053,10/1/1994,F,JAMSHEDPUR,17819.05,8/2/2016,12:00:00 AM,25.00
1,T2,C2142763,4/4/1957,M,JHAJJAR,2270.69,8/2/2016,12:00:00 AM,27999.00
2,T3,C4417068,26/11/1996,F,MUMBAI,17874.44,8/2/2016,12:00:00 AM,459.00
3,T4,C5342380,14/09/1973,F,MUMBAI,866503.21,8/2/2016,12:00:00 AM,2060.00
4,T5,C9031234,24/03/1988,F,NAVI MUMBAI,6714.43,8/2/2016,12:00:00 AM,1762.50
5,T6,C1536588,8/10/1972,F,ITANAGAR,53609.20,8/2/2016,12:00:00 AM,676.00
6,T7,C7126560,26/01/1992,F,MUMBAI,973.46,8/2/2016,12:00:00 AM,566.00
7,T8,C1220223,27/01/1982,M,MUMBAI,95075.54,8/2/2016,12:00:00 AM,148.00
8,T9,C8536061,19/04/1988,F,GURGAON,14906.96,8/2/2016,12:00:00 AM,833.00
9,T10,C6638934,22/06/1984,M,MUMBAI,4279.22,8/2/2016,12:00:00 AM,289.11
10,T11,C5430833,22/07/1982,M,MOHALI,48429.49,8/2/2016,12:00:00 AM,259.00
11,T12,C6939838,7/7/1988,M,GUNTUR,14613.46,8/2/2016,12:00:00 AM,202.00
12,T13,C6339347,13/06/1978,M,AHMEDABAD,32274.78,8/2/2016,12:00:00 AM,12300.00
13,T14,C8327851,5/1/1992,F,THANE,59950.44,8/1/2016,12:00:00 AM,50.00
14,T15,C7917151,24/03/1978,M,PUNE,10100.84,8/1/2016,12:00:00 AM,338.00
15,T16,C8334633,10/7/1968,F,NEW DELHI,1283.12,8/1/2016,12:00:00 AM,250.00
16,T17,C1376215,1/1/1800,M,MUMBAI,77495.15,8/1/2016,12:00:00 AM,1423.11
17,T18,C8967349,16/07/1989,M,MUMBAI,2177.85,8/1/2016,12:00:00 AM,54.00
18,T19,C3732016,11/1/1991,M,MUMBAI,32816.17,8/1/2016,12:00:00 AM,315.00
19,T20,C8999019,24/06/1985,M,PUNE,10643.50,8/1/2016,12:00:00 AM,945.00

3- convert the transaction date column  to datetime format

In [15]:
data.dtypes

TransactionID            object
CustomerID               object
CustomerDOB              object
CusGender                object
CustLocation             object
 CustAccountBalance      object
TransactionDate          object
TransactionTime          object
TransactionAmount       float64
dtype: object

In [17]:
data['TransactionDate']=pd.to_datetime(data['TransactionDate'])

In [19]:
data.dtypes

TransactionID                   object
CustomerID                      object
CustomerDOB                     object
CusGender                       object
CustLocation                    object
 CustAccountBalance             object
TransactionDate         datetime64[ns]
TransactionTime                 object
TransactionAmount              float64
dtype: object

In [21]:
data

,TransactionID,CustomerID,CustomerDOB,CusGender,CustLocation,CustAccountBalance,TransactionDate,TransactionTime,TransactionAmount
0,T1,C5841053,10/1/1994,F,JAMSHEDPUR,17819.05,2016-08-02,12:00:00 AM,25.0
1,T2,C2142763,4/4/1957,M,JHAJJAR,2270.69,2016-08-02,12:00:00 AM,27999.0
2,T3,C4417068,26/11/1996,F,MUMBAI,17874.44,2016-08-02,12:00:00 AM,459.0
3,T4,C5342380,14/09/1973,F,MUMBAI,866503.21,2016-08-02,12:00:00 AM,2060.0
4,T5,C9031234,24/03/1988,F,NAVI MUMBAI,6714.43,2016-08-02,12:00:00 AM,1762.5
...,...,...,...,...,...,...,...,...,...
35123,T35124,C5923939,20/07/1990,M,NOIDA,214.39,NaT,12:00:00 AM,102.0
35124,T35125,C5642844,4/11/1989,F,THIRUVANANTHAPURAM,219310.56,NaT,12:00:00 AM,170.0
35125,T35126,C4342918,13/04/1993,M,JAMNAGAR,359.01,NaT,12:00:00 AM,2639.0
35126,T35127,C5329273,18/06/1988,F,LUCKNOW,52524.61,NaT,12:00:00 AM,163.0
35127,T35128,C6714728,Oct-00,NaN,NaN,NaN,NaT,NaN,NaN

4- filter the transaction amount with an amount grater than 1000

In [24]:
t=data[data['TransactionAmount']>10000]

In [26]:
t.head(10)

,TransactionID,CustomerID,CustomerDOB,CusGender,CustLocation,CustAccountBalance,TransactionDate,TransactionTime,TransactionAmount
1,T2,C2142763,4/4/1957,M,JHAJJAR,2270.69,2016-08-02,12:00:00 AM,27999.0
12,T13,C6339347,13/06/1978,M,AHMEDABAD,32274.78,2016-08-02,12:00:00 AM,12300.0
46,T47,C8934588,23/10/1981,M,JAIPUR,5055.18,2016-08-03,12:00:00 AM,13846.0
49,T50,C5242591,1/12/1982,M,BURDWAN,22525.66,2016-08-05,12:00:00 AM,27990.0
137,T138,C4234628,18/03/1988,M,MUMBAI,3186.20,2016-08-04,12:00:00 AM,10885.0
186,T187,C6323747,10/8/1988,M,DELHI,556731.79,2016-08-08,12:00:00 AM,26991.0
193,T194,C4325361,1/1/1800,M,KOLKATA,133203.58,2016-08-07,12:00:00 AM,100000.0
206,T207,C7675278,1/1/1800,M,NOIDA,1867210.51,2016-08-07,12:00:00 AM,137890.0
245,T246,C4814390,1/10/1971,F,MIRA ROAD E,78122.46,NaT,12:00:00 AM,47290.0
246,T247,C6437438,22/05/1983,F,BHUBANESHWAR,324551.50,NaT,12:00:00 AM,25000.0

5- sort trascation amount

In [29]:
s=data.sort_values(by='TransactionAmount',ascending = False)

In [31]:
s.tail(10)

,TransactionID,CustomerID,CustomerDOB,CusGender,CustLocation,CustAccountBalance,TransactionDate,TransactionTime,TransactionAmount
31873,T31874,C3412424,NaN,M,NEW DELHI,797654.95,NaT,12:00:00 AM,0.0
17560,T17561,C3523153,1/1/1800,M,GUJARAT UDWADA,35246.44,NaT,12:00:00 AM,0.0
25390,T25391,C1918786,21/11/1994,M,MUMBAI,34776.23,NaT,12:00:00 AM,0.0
12644,T12645,C5451827,6/5/1977,F,DELHI,445212.50,NaT,12:00:00 AM,0.0
21294,T21295,C8239592,5/1/1987,M,GURGAON,49936.98,NaT,12:00:00 AM,0.0
2672,T2673,C4397046,13/01/1997,M,MUMBAI,185401.34,NaT,12:00:00 AM,0.0
4455,T4456,C7434078,2/8/1987,F,GURGAON,146406.58,NaT,12:00:00 AM,0.0
5232,T5233,C2539539,5/1/1987,M,GURGAON,49936.98,NaT,12:00:00 AM,0.0
33996,T33997,C4554127,27/04/1986,M,NAVI MUMBAI,20786.14,NaT,12:00:00 AM,0.0
35127,T35128,C6714728,Oct-00,NaN,NaN,NaN,NaT,NaN,NaN

6- avarage _CustAccountBalance

In [34]:
data['CustAccountBalance'].mean()

KeyError: 'CustAccountBalance'

In [ ]:
data

8-extract from  TransactionTime

In [ ]:
data.dtypes

In [ ]:
data['TransactionHour']=data['TransactionTime'].str[:2]

In [ ]:
data['TransactionHour']

In [ ]:
data

In [ ]:
data['TransactionMin']=data['TransactionTime'].str[2:4]

data

In [ ]:
data.count()

In [ ]:
data['CusGender'].value_counts()

5- filter transction 2016

In [ ]:
data.dtypes

In [ ]:
data[data['TransactionDate']=='2016-08-02'].head(15)

9- the uniqe value in CustLocation

In [ ]:
data['CustLocation'].unique()

In [ ]:
data['CustLocation'].nunique()

In [ ]:
data['TransactionAmount'].max()

In [ ]:
data['TransactionAmount'].mean()

10-group the cuslocation and calculate the sum casamount

In [ ]:
total_amount=data.groupby('CustLocation')['TransactionAmount'].sum()

In [ ]:
total_amount.head()

11-check for missing value

In [ ]:
data.isnull().sum()

12- transaction happend in 2016

In [ ]:
data['TransactionDate']

In [ ]:
data.dtypes

In [ ]:
data['TransactionDate']=pd.to_datetime(data['TransactionDate'])

In [ ]:
data.dtypes

In [ ]:
data[data['TransactionDate'].dt.year ==2016].count()['TransactionDate']

12- rename transactionamount coulmn

In [103]:
data.rename(columns={'TransactionAmount':'TransactionAMOUNT'},inplace=True)

In [101]:
data

,TransactionID,CustomerID,CustomerDOB,CusGender,CustLocation,CustAccountBalance,TransactionDate,TransactionTime,TransactionAMOUNT
0,T1,C5841053,10/1/1994,F,JAMSHEDPUR,17819.05,2016-08-02,12:00:00 AM,25.0
1,T2,C2142763,4/4/1957,M,JHAJJAR,2270.69,2016-08-02,12:00:00 AM,27999.0
2,T3,C4417068,26/11/1996,F,MUMBAI,17874.44,2016-08-02,12:00:00 AM,459.0
3,T4,C5342380,14/09/1973,F,MUMBAI,866503.21,2016-08-02,12:00:00 AM,2060.0
4,T5,C9031234,24/03/1988,F,NAVI MUMBAI,6714.43,2016-08-02,12:00:00 AM,1762.5
...,...,...,...,...,...,...,...,...,...
35123,T35124,C5923939,20/07/1990,M,NOIDA,214.39,NaT,12:00:00 AM,102.0
35124,T35125,C5642844,4/11/1989,F,THIRUVANANTHAPURAM,219310.56,NaT,12:00:00 AM,170.0
35125,T35126,C4342918,13/04/1993,M,JAMNAGAR,359.01,NaT,12:00:00 AM,2639.0
35126,T35127,C5329273,18/06/1988,F,LUCKNOW,52524.61,NaT,12:00:00 AM,163.0
35127,T35128,C6714728,Oct-00,NaN,NaN,NaN,NaT,NaN,NaN

13-check the duplacte rows

In [ ]:
data.duplicated().sum()

In [ ]:
data.drop_duplicates(inplace=True)

14-select only CustomerID CusGender TransactionAMOUNT coulmns

In [97]:
data[['CustomerID','CusGender','TransactionAMOUNT']]

KeyError: "['TransactionAMOUNT'] not in index"

In [ ]:
data[data['CusGender']=='F'].count()

13-transaction made after 2016

In [ ]:
data.dtypes

In [ ]:
data['TransactionDate']=pd.to_datetime(data['TransactionDate'])

In [ ]:
data[data['TransactionDate'] > '2016,08,02'].count()['TransactionDate']

14-transaction where the amount between 300 and 600

In [93]:
data[(data['TransactionAMOUNT']>300) & (data['TransactionAMOUNT']<600)]

KeyError: 'TransactionAMOUNT'

17-filter transaction from spacifi location

In [74]:
data[data['CustLocation'].isin(['BANGALORE','MUMBAI'])].count()['CustomerID']

6307

18-total number of transaction

In [90]:
data['TransactionID'].count()

35128

20-aggregation function and grouping

In [148]:
max_trans=data.groupby('CustomerID')['TransactionAMOUNT'].max()

In [150]:
max_trans.head(10)

CustomerID
C1010011    4750.0
C1010211    2209.0
C1010245     300.0
C1010249     263.0
C1010266     449.0
C1010425     658.0
C1010461    1000.0
C1010864     500.0
C1010876    1054.0
C1010930     300.0
Name: TransactionAMOUNT, dtype: float64

In [162]:
min_trans=data.groupby('CustomerID')['TransactionAMOUNT'].min()

In [164]:
min_trans.head(10)

CustomerID
C1010011    4750.0
C1010211    2209.0
C1010245     300.0
C1010249     263.0
C1010266     449.0
C1010425     658.0
C1010461    1000.0
C1010864     500.0
C1010876    1054.0
C1010930     300.0
Name: TransactionAMOUNT, dtype: float64

In [167]:
max_trans=data.groupby('CustomerID')['TransactionAMOUNT'].sum().idxmax()

In [169]:
max_trans

'C7367184'

In [171]:
minx_trans=data.groupby('CustomerID')['TransactionAMOUNT'].sum().idxmin()

In [173]:
minx_trans

'C1310279'

In [179]:
all=data.groupby('CustomerID')['TransactionAMOUNT'].agg(['count','max','min','sum'])

In [181]:
all

            count      max      min      sum
CustomerID
C1010011        1  4750.00  4750.00  4750.00
C1010211        1  2209.00  2209.00  2209.00
C1010245        1   300.00   300.00   300.00
C1010249        1   263.00   263.00   263.00
C1010266        1   449.00   449.00   449.00
...           ...      ...      ...      ...
C9097335        1   374.88   374.88   374.88
C9098316        1    40.00    40.00    40.00
C9099255        1   240.00   240.00   240.00
C9099692        1   249.00   249.00   249.00
C9099956        1   855.00   855.00   855.00

[34914 rows x 4 columns]

In [183]:
all.to_csv('C:/Users/enaam/OneDrive/Desktop/PYTHON/NEW.csv')

21- transformation

In [186]:
data.dtypes

TransactionID                   object
CustomerID                      object
CustomerDOB                     object
CusGender                       object
CustLocation                    object
 CustAccountBalance             object
TransactionDate         datetime64[ns]
TransactionTime                 object
TransactionAMOUNT              float64
dtype: object

In [198]:
data['new_column_date']= pd .to_datetime(data['TransactionDate'],format ="%y,%m,%d")

In [200]:
data['new_column_date']

0       2016-08-02
1       2016-08-02
2       2016-08-02
3       2016-08-02
4       2016-08-02
           ...
35123          NaT
35124          NaT
35125          NaT
35126          NaT
35127          NaT
Name: new_column_date, Length: 35128, dtype: datetime64[ns]

In [202]:
data

,TransactionID,CustomerID,CustomerDOB,CusGender,CustLocation,CustAccountBalance,TransactionDate,TransactionTime,TransactionAMOUNT,new_column_date
0,T1,C5841053,10/1/1994,F,JAMSHEDPUR,17819.05,2016-08-02,12:00:00 AM,25.0,2016-08-02
1,T2,C2142763,4/4/1957,M,JHAJJAR,2270.69,2016-08-02,12:00:00 AM,27999.0,2016-08-02
2,T3,C4417068,26/11/1996,F,MUMBAI,17874.44,2016-08-02,12:00:00 AM,459.0,2016-08-02
3,T4,C5342380,14/09/1973,F,MUMBAI,866503.21,2016-08-02,12:00:00 AM,2060.0,2016-08-02
4,T5,C9031234,24/03/1988,F,NAVI MUMBAI,6714.43,2016-08-02,12:00:00 AM,1762.5,2016-08-02
...,...,...,...,...,...,...,...,...,...,...
35123,T35124,C5923939,20/07/1990,M,NOIDA,214.39,NaT,12:00:00 AM,102.0,NaT
35124,T35125,C5642844,4/11/1989,F,THIRUVANANTHAPURAM,219310.56,NaT,12:00:00 AM,170.0,NaT
35125,T35126,C4342918,13/04/1993,M,JAMNAGAR,359.01,NaT,12:00:00 AM,2639.0,NaT
35126,T35127,C5329273,18/06/1988,F,LUCKNOW,52524.61,NaT,12:00:00 AM,163.0,NaT
35127,T35128,C6714728,Oct-00,NaN,NaN,NaN,NaT,NaN,NaN,NaT

22-procssing

In [205]:
data.isnull().sum()

TransactionID               0
CustomerID                  0
CustomerDOB               151
CusGender                  25
CustLocation                3
 CustAccountBalance        39
TransactionDate         34862
TransactionTime             1
TransactionAMOUNT           1
new_column_date         34862
dtype: int64

In [218]:
data['CustLocation'].fillna('known',inplace=True)

In [220]:
data.isnull().sum()

TransactionID               0
CustomerID                  0
CustomerDOB               151
CusGender                  25
CustLocation                0
 CustAccountBalance        39
TransactionDate         34862
TransactionTime             1
TransactionAMOUNT           1
new_column_date         34862
dtype: int64

In [235]:
data['CusGender'].replace({'F':"Famale","M":"Male"},inplace=True)

In [237]:
data['CusGender']

0        Famale
1          Male
2        Famale
3        Famale
4        Famale
          ...
35123      Male
35124    Famale
35125      Male
35126    Famale
35127       NaN
Name: CusGender, Length: 35128, dtype: object

In [241]:
data.dtypes

TransactionID                   object
CustomerID                      object
CustomerDOB                     object
CusGender                       object
CustLocation                    object
 CustAccountBalance             object
TransactionDate         datetime64[ns]
TransactionTime                 object
TransactionAMOUNT              float64
new_column_date         datetime64[ns]
dtype: object

In [261]:
data['TransactionAMOUNT' ] = data['TransactionAMOUNT'].astype(int)

IntCastingNaNError: Cannot convert non-finite values (NA or inf) to integer